# Combining Datasets: Concat and Append

In [26]:
import pandas as pd
import numpy as np

## Recall: Concatenation of NumPy Arrays

In [27]:
x = np.array([1, 2, 3])
y = np.array([4, 5, 6])
z = np.array([7, 8, 9])
np.concatenate([x, y, z])

array([1, 2, 3, 4, 5, 6, 7, 8, 9])

In [28]:
x = [[1, 2],
     [3, 4]]
np.concatenate([x, x], axis=1)

array([[1, 2, 1, 2],
       [3, 4, 3, 4]])

## Simple Concatenation with ``pd.concat``

In [29]:
ser1 = pd.Series(['A', 'B', 'C'], index=[1, 2, 3])
ser2 = pd.Series(['D', 'E', 'F'], index=[4, 5, 6])
pd.concat([ser1, ser2])

1    A
2    B
3    C
4    D
5    E
6    F
dtype: object

It also works to concatenate higher-dimensional objects, such as ``DataFrame``s:

In [35]:
df1 = pd.DataFrame([['a', 1], ['b', 2]],
                   columns=['letter', 'number'])

df2 = pd.DataFrame([['c', 3], ['d', 4]],
                   columns=['letter', 'number'])

In [36]:
df1

  letter  number
0      a       1
1      b       2

In [37]:
df2

  letter  number
0      c       3
1      d       4

In [38]:
pd.concat([df1,df2])

#by default - axis is row (0)

  letter  number
0      a       1
1      b       2
0      c       3
1      d       4

In [39]:
pd.concat([df1,df2],axis = 1)

  letter  number letter  number
0      a       1      c       3
1      b       2      d       4

In [45]:
df3 = pd.DataFrame([['c', 3], ['d', 4]],
                   index=['3', '4'],
                   columns=['Alphabets', 'unicode'])

In [46]:
df3

  Alphabets  unicode
3         c        3
4         d        4

In [47]:
df1

  letter  number
0      a       1
1      b       2

In [48]:
pd.concat([df1,df3],axis = 1)

  letter  number Alphabets  unicode
0      a     1.0       NaN      NaN
1      b     2.0       NaN      NaN
3    NaN     NaN         c      3.0
4    NaN     NaN         d      4.0

### Duplicate indices

In [54]:

pd.concat([df1, df2])

  letter  number
0      a       1
1      b       2
0      c       3
1      d       4

#### Ignoring the index

Sometimes the index itself does not matter, and you would prefer it to simply be ignored.
This option can be specified using the ``ignore_index`` flag.
With this set to true, the concatenation will create a new integer index for the resulting ``Series``:

In [59]:
pd.concat([df1, df2],ignore_index=True )

  letter  number
0      a       1
1      b       2
2      c       3
3      d       4